# Taps
tap 'caskroom/cask'
tap 'versions'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'scribusproject/scribus'

# Install/update shells
brew 'zsh'
brew 'zsh-completions'
# Bash 4
brew 'bash'

# Install utilities
brew 'mas'
brew 'mackup'
brew 'neofetch'
brew 'profanity', args: ['with-terminal-notifier']
brew 'ruby-build'
brew 'rbenv'
brew 'smartmontools'
brew 'speedtest_cli'
brew 'terminal-notifier'
brew 'wakeonlan'

cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'inkscape'
cask 'iterm2'
cask 'libreoffice'
cask 'macpass'
cask 'scribus'
cask 'spotify'
cask 'ubersicht'
cask 'xquartz'
# cask 'thunderbird'

# Fonts
cask 'font-averia-libre'
cask 'font-bungee'
cask 'font-codystar'
cask 'font-expletus-sans'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-im-fell-dw-pica'
cask 'font-linux-biolinum'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-roboto-condensed'
cask 'font-share'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store apps
mas 'Logic Pro X', id: 634148309
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Memory Clean', id: 451444120
# mas 'Wunderlist', id: 410628904
